app/Controllers/Dashboard.php

    public function index()
    {
        $poli = $this->request->getVar('poli');
        $type = $this->request->getVar('type');
        if (is_null($poli)) {
            $poli = 1;
        };

        if (is_null($type)) {
            $type = 1;
        }
        // // $transactionModels = new TransactionModel();
        $serviceUnitModels = new ServiceUnitModel();
        $data['title'] = "Dashboard";
        $data['username'] = session()->get('username');
        $data['role'] = session()->get('role');
        $data['pagesidebar'] = 1;
        $data['subsidebar'] = 0;
        $data['serviceunits'] = $serviceUnitModels->findAll();
        $data['poli'] = $poli;
        $data['type'] = $type;
        $db = \Config\Database::connect();

        if ($type == 1) {
            $tpModels = new TransactionPublicModel;
            $data["transactions"] = $db->table('transaction_public')
                ->select("MONTH(loan_date) as month ,COUNT(loan_date)  as totalloan, COUNT(return_date)  as totalreturn")
                ->join('transaction', 'transaction.id = transaction_public.transaction_id')
                ->join('public_doc', 'public_doc.id = transaction_public.public_id')
                ->orderBy('transaction.loan_date')
                ->where('YEAR(transaction.loan_date)', '2024')
                ->where('public_doc.service_id', $poli)
                ->groupBy('MONTH(transaction.loan_date)')
                ->get()
                ->getResultArray();

            $count = $db->table('transaction_public')
                ->select('COUNT(transaction.id) as count_late')
                ->join('transaction', 'transaction.id = transaction_public.transaction_id')
                ->join('public_doc', 'public_doc.id = transaction_public.public_id')
                ->where('transaction.return_date > transaction.deadline')
                ->where('public_doc.service_id', $poli)
                ->get()
                ->getRow();
            $data['count'] = $count;
        } elseif ($type == 2) {
            $tcModels = new TransactionCoassModel;
            $data["transactions"] = $db->table('transaction_coass')
                ->select("MONTH(loan_date) as month, COUNT(loan_date) as totalloan, COUNT(return_date) as totalreturn")
                ->join('transaction', 'transaction.id = transaction_coass.transaction_id')
                ->join('coass_doc', 'coass_doc.id = transaction_coass.coass_id')
                ->orderBy('transaction.loan_date')
                ->where('YEAR(transaction.loan_date)', '2024')
                ->where('coass_doc.service_id', $poli)
                ->groupBy('MONTH(transaction.loan_date)')
                ->get()
                ->getRow();

            $count = $db->table('transaction_coass')
                ->select('COUNT(transaction.id) as count_late')
                ->join('transaction', 'transaction.id = transaction_coass.transaction_id')
                ->join('coass_doc', 'coass_doc.id = transaction_coass.coass_id')
                ->where('transaction.return_date > transaction.deadline')
                ->where('coass_doc.service_id', $poli)
                ->get()
                ->getRow();
---
SELECT *
FROM `service_unit`
SELECT MONTH(loan_date) as month, COUNT(loan_date)  as totalloan, COUNT(return_date)  as totalreturn
FROM `transaction_public`
JOIN `transaction` ON `transaction`.`id` = `transaction_public`.`transaction_id`
JOIN `public_doc` ON `public_doc`.`id` = `transaction_public`.`public_id`
WHERE YEAR(transaction.loan_date) = '2024'
AND `public_doc`.`service_id` = '2'
GROUP BY MONTH(transaction.loan_date)
ORDER BY `transaction`.`loan_date`
SELECT COUNT(transaction.id) as count_late
FROM `transaction_public`
JOIN `transaction` ON `transaction`.`id` = `transaction_public`.`transaction_id`
JOIN `public_doc` ON `public_doc`.`id` = `transaction_public`.`public_id`
WHERE `transaction`.`return_date` > `transaction`.`deadline`
AND `public_doc`.`service_id` = '2'
SELECT MONTH(loan_date) as month, COUNT(loan_date) as totalloan, COUNT(return_date) as totalreturn
FROM `transaction_coass`
JOIN `transaction` ON `transaction`.`id` = `transaction_coass`.`transaction_id`
JOIN `coass_doc` ON `coass_doc`.`id` = `transaction_coass`.`coass_id`
WHERE YEAR(transaction.loan_date) = '2024'
AND `coass_doc`.`service_id` = 2
GROUP BY MONTH(transaction.loan_date)
ORDER BY `transaction`.`loan_date`
SELECT COUNT(transaction.id) as count_late
FROM `transaction_coass`
JOIN `transaction` ON `transaction`.`id` = `transaction_coass`.`transaction_id`
JOIN `coass_doc` ON `coass_doc`.`id` = `transaction_coass`.`coass_id`
WHERE `transaction`.`return_date` > `transaction`.`deadline`
AND `coass_doc`.`service_id` = 2