app/Controllers/Dashboard.php

    public function index()
    {
        $transactionModels = new TransactionModel();
        $data['title'] = "Dashboard";
        $data['username'] = session()->get('username');
        $data['pagesidebar'] = 1;
        $data['subsidebar'] = 0;

        $transactions = $transactionModels->select("MONTH(loan_date) as month, COUNT(loan_date) as totalloan, COUNT(return_date) as totalreturn")
            ->orderBy('loan_date')
            ->where('YEAR(loan_date)', '2024')
            ->groupBy('MONTH(loan_date)')
            ->findAll();

        $data['transactions'] = $transactions;

        $count = $transactionModels
            ->select('COUNT(*) as count_late')
            ->where('is_late', 2)
            ->first();
---
SELECT MONTH(loan_date) as month, COUNT(loan_date) as totalloan, COUNT(return_date) as totalreturn
FROM `transaction`
WHERE YEAR(loan_date) = '2024'
GROUP BY MONTH(loan_date)
ORDER BY `loan_date`
SELECT COUNT(*) as count_late
FROM `transaction`
WHERE `is_late` = 2
 LIMIT 1