app/Controllers/Dashboard.php

    public function index()
    {
        $poli = $this->request->getVar('poli');

        $transactionModels = new TransactionModel();
        $serviceUnitModels = new ServiceUnitModel();
        $data['title'] = "Dashboard";
        $data['username'] = session()->get('username');
        $data['role'] = session()->get('role');
        $data['pagesidebar'] = 1;
        $data['subsidebar'] = 0;
        $data['serviceunits'] = $serviceUnitModels->findAll();
        $data['poli'] = $poli;

        $transactions = $transactionModels->select("MONTH(loan_date) as month, COUNT(loan_date) as totalloan, COUNT(return_date) as totalreturn")
            ->join('medical_records', 'medical_records.rm_id = transaction.rm_id')
            ->orderBy('loan_date')
            ->where('YEAR(loan_date)', '2024')
            ->where('service_unit', $poli)
            ->groupBy('MONTH(loan_date)')
            ->findAll();
---
SELECT MONTH(loan_date) as month, COUNT(loan_date) as totalloan, COUNT(return_date) as totalreturn
FROM `transaction`
JOIN `medical_records` ON `medical_records`.`rm_id` = `transaction`.`rm_id`
WHERE YEAR(loan_date) = '2024'
AND `service_unit` IS NULL
GROUP BY MONTH(loan_date)
ORDER BY `loan_date`