app/Controllers/LoanPublic.php

    public function index()
    {
        // $recordmedicalModel = new RecordMedicalModel();
        $tpmodels = new TransactionPublicModel();
        $data['pagesidebar'] = 3;
        $data['subsidebar'] = 4;
        $data['role'] = session()->get('role');
        $data['publicdata'] = $tpmodels
            ->select('transaction.id,public_doc.fullname,public_doc.identity_number,transaction.rm_id')
            ->join('transaction', 'transaction.id = transaction_public.transaction_id')
            ->join('public_doc', 'public_doc.id = transaction_public.public_id')
            ->where('transaction.is_return', 1)
            // ->join('medical_records', 'transaction.rm_id = medical_records.rm_id')
            ->orderBy('loan_date', 'desc')
            ->paginate(20, 'loancoass');
        $data['pager'] = $tpmodels->pager;
        $data['nomor'] = nomor($this->request->getVar('page_loanpublic'), 20);
        $data['title'] = 'Peminjaman Umum';
        $data['type'] = 1;
        $data['username'] = session()->get('username');
---
SELECT *
FROM `public_doc`