app/Controllers/LoanCoass.php

    public function add()
    {

        $serviceUnitModels = new ServiceUnitModel();
        $data['pagesidebar'] = 3;
        $data['subsidebar'] = 4;
        $data['role'] = session()->get('role');
        $data['title'] = 'Tambah Pinjaman COASS';
        $data['username'] = session()->get('username');
        $data['serviceunits'] = $serviceUnitModels->findAll();
---
SELECT *
FROM `service_unit`