app/Controllers/PrintPDF.php

SELECT *
FROM `medical_records`
JOIN `service_unit` ON `service_unit`.`id` = `medical_records`.`service_unit`
WHERE `medical_records`.`rm_id` = 'ffff93b5-6252-3ed4-8502-2dc076724ef0'
SELECT *
FROM `medical_records`
WHERE `medical_records`.`rm_id` = '072059'
---
    public function printrm($id)
    {
        $generator = new BarcodeGeneratorHTML();
        $recordmedicalModel = new RecordMedicalModel();
        $data['role'] = session()->get('role');
        $data['profile'] = $recordmedicalModel->join('service_unit', 'service_unit.id = medical_records.service_unit')
            ->getWhere(['medical_records.rm_id' => $id])
            ->getRow();
        $data['title'] = 'Detail Rekam Medis';
        $data['pagesidebar'] = 2;
        $data['subsidebar'] = 1;
        $data['username'] = session()->get('username');