app/Controllers/PrintPDF.php

SELECT `transaction`.`id` as `tid`, `medical_records`.`rm_id`, `medical_records`.`fullname`, `transaction`.`loan_date`, `transaction`.`loan_desc`, `service_unit`.`service_name`
FROM `transaction_coass`
JOIN `transaction` ON `transaction_coass`.`transaction_id` = `transaction`.`id`
JOIN `medical_records` ON `medical_records`.`rm_id` = `transaction`.`rm_id`
JOIN `coass_doc` ON `coass_doc`.`id` = `transaction_coass`.`coass_id`
JOIN `service_unit` ON `service_unit`.`id` = `coass_doc`.`service_id`
WHERE `transaction`.`id` = '9'
---
    public function printTracerCoass($id)
    {
        $tcModel = new TransactionCoassModel();
        $data['role'] = session()->get('role');
        $data['tracer'] = $tcModel
            ->select('transaction.id as tid , medical_records.rm_id, medical_records.fullname,
        transaction.loan_date,transaction.loan_desc,service_unit.service_name')
            ->join('transaction', 'transaction_coass.transaction_id = transaction.id')
            ->join('medical_records', 'medical_records.rm_id = transaction.rm_id')
            ->join('coass_doc', 'coass_doc.id = transaction_coass.coass_id')
            ->join('service_unit', 'service_unit.id = coass_doc.service_id')
            ->getwhere(['transaction.id' => $id])
            ->getRow();