app/Controllers/PublicDoc.php

    public function show($id)
    {
        $data['username'] = session()->get('username');
        $data['role'] = session()->get('role');
        $data['pagesidebar'] = 2;
        $data['subsidebar'] = 7;

        $publicModels = new PublicModel();

        if ($publicModels->find($id)) {
            $publicdata = $publicModels->select('public_doc.fullname,
            public_doc.identity_number,
            public_doc.address,
            public_doc.phone,
            service_unit.service_name')
                ->join('service_unit', 'service_unit.id = public_doc.service_id')
                ->find($id);
---
SELECT `public_doc`.`fullname`, `public_doc`.`identity_number`, `public_doc`.`address`, `public_doc`.`phone`, `service_unit`.`service_name`
FROM `public_doc`
JOIN `service_unit` ON `service_unit`.`id` = `public_doc`.`service_id`
WHERE `public_doc`.`id` = '1'