app/Controllers/RecordMedical.php

SELECT `medical_records`.`rm_id`, `fullname`
FROM `medical_records`
WHERE `medical_records`.`is_return` = 2
ORDER BY `medical_records`.`rm_id`
 LIMIT 5
SELECT `medical_records`.`rm_id`, `fullname`
FROM `medical_records`
WHERE `medical_records`.`is_return` = 2
AND   (
`medical_records`.`rm_id` LIKE '%wisn%' ESCAPE '!'
OR  `medical_records`.`fullname` LIKE '%wisn%' ESCAPE '!'
 )
ORDER BY `medical_records`.`rm_id`
 LIMIT 5
---
    public function searchData()
    {

        $postData = $this->request->getVar('searchTerm');

        $response = array();
        $db = \Config\Database::connect();

        $subQuery = $db->table('transaction')
            ->select('rm_id, MAX(id) as latest_transaction_id')
            ->groupBy('rm_id')
            ->getCompiledSelect();
        $recordmedicalModel = new RecordMedicalModel();
        if (!isset($postData)) {
            // Fetch record
            $recordmedicals = $recordmedicalModel->select('medical_records.rm_id, fullname')
                // ->join("($subQuery) as latest_trans", 'medical_records.rm_id = latest_trans.rm_id', 'left')
                // ->join('transaction', 'latest_trans.latest_transaction_id = transaction.id', 'left')
                // ->groupStart()  // Mulai grup kondisi
                ->where('medical_records.is_return', 2)
                // ->orWhere('transaction.is_return IS NULL')
                // ->groupEnd()
                ->orderBy('medical_records.rm_id')
                ->findAll(5);
        } else {
            $recordmedicals = $recordmedicalModel->select('medical_records.rm_id, fullname')
                ->where('medical_records.is_return', 2)
                ->groupStart()
                ->like('medical_records.rm_id', $postData)
                ->orLike('medical_records.fullname', $postData)
                ->groupEnd()
                ->orderBy('medical_records.rm_id')
                ->findAll(5);