app/Controllers/RecordMedical.php

    public function add()
    {
        $serviceunitmodel = new ServiceUnitModel();
        $data['title'] = 'Tambah Rekam Medis';
        $data['role'] = session()->get('role');
        $data['username'] = session()->get('username');
        $data['pagesidebar'] = 2;
        $data['subsidebar'] = 1;
        $data['serviceunits'] = $serviceunitmodel->findAll();
---
SELECT *
FROM `service_unit`