app/Controllers/ReturnDocument.php

SELECT COUNT(*) AS `numrows`
FROM `medical_records`
JOIN `transaction` ON `transaction`.`rm_id` = `medical_records`.`rm_id`
JOIN `service_unit` ON `service_unit`.`id` = `medical_records`.`service_unit`
SELECT `transaction`.`id` as `tid`, `transaction`.`rm_id` as `idrm`, `medical_records`.`fullname`, `service_unit`.`service_name`, `transaction`.`loan_date`, `transaction`.`return_date`
FROM `medical_records`
JOIN `transaction` ON `transaction`.`rm_id` = `medical_records`.`rm_id`
JOIN `service_unit` ON `service_unit`.`id` = `medical_records`.`service_unit`
ORDER BY `loan_date` ASC
 LIMIT 80, 20
---
    public function index()
    {
        $trasactionModels = new TransactionModel();
        $data['trasactions'] = $trasactionModels
            ->select('transaction.id as tid,transaction.rm_id as idrm, public_doc.fullname,
            service_unit.service_name, transaction.loan_date, transaction.phone,
            transaction.return_date, transaction.deadline ')
            ->join('medical_records', 'transaction.rm_id = medical_records.rm_id')
            ->join('public_doc', 'public_doc.transaction_id = transaction.id')
            ->join('service_unit', 'service_unit.id = medical_records.service_unit')
            ->orderBy('return_date', 'asc')
            ->paginate(20, 'returndoc');