app/Controllers/ReturnDocument.php

SELECT `transaction`.`id`, `transaction`.`rm_id`, `medical_records`.`fullname`, `service_name`, `transaction`.`loan_date`, `transaction`.`return_date`, `transaction`.`return_desc`
FROM `transaction`
JOIN `medical_records` ON `medical_records`.`rm_id` = `transaction`.`rm_id`
JOIN `service_unit` ON `service_unit`.`id` = `medical_records`.`service_unit`
WHERE `transaction`.`id` = '4'
---
    public function edit($id)
    {

        $transactionModels = new TransactionModel();
        $transaction = $transactionModels
            ->select('transaction.id,transaction.rm_id, medical_records.fullname,service_name,
            transaction.loan_date, transaction.return_date, transaction.return_desc ')
            ->join('medical_records', 'medical_records.rm_id = transaction.rm_id')
            ->join('service_unit', 'service_unit.id = medical_records.service_unit')
            ->getWhere(['transaction.id' => $id])->getRow();