app/Controllers/ReturnDocumentCoass.php

SELECT COUNT(*) AS `numrows`
FROM `transaction`
JOIN `medical_records` ON `transaction`.`rm_id` = `medical_records`.`rm_id`
JOIN `coass_doc` ON `coass_doc`.`transaction_id` = `transaction`.`id`
JOIN `service_unit` ON `service_unit`.`id` = `medical_records`.`service_unit`
---
    public function index()
    {
        $trasactionModels = new TransactionModel();
        $data['trasactions'] = $trasactionModels
            ->select('transaction.id as tid,transaction.rm_id as idrm,transaction.phone, coass_doc.coass_name, service_unit.service_name, transaction.loan_date, transaction.return_date, transaction.deadline ')
            ->join('medical_records', 'transaction.rm_id = medical_records.rm_id')
            ->join('coass_doc', 'coass_doc.transaction_id = transaction.id')
            ->join('service_unit', 'service_unit.id = medical_records.service_unit')
            ->orderBy('loan_date', 'asc')
            ->paginate(20, 'returndoc');