app/Controllers/Tracer.php

    public function findloanpublic()
    {
        $recordmedicalModel = new RecordMedicalModel();
        $generator = new BarcodeGeneratorHTML();
        $id = $this->request->getVar('id');
        $data['data'] = $recordmedicalModel
            ->select('transaction.id as tid , medical_records.rm_id as id_rekam_medik, medical_records.fullname,
            transaction.loan_date,transaction.loan_desc,service_unit.service_name')
            ->join('transaction', 'medical_records.rm_id = transaction.rm_id')
            ->join('transaction_public', 'transaction.id = transaction_public.transaction_id')
            ->join('public_doc', 'public_doc.id = transaction_public.public_id')
            ->join('service_unit', 'service_unit.id = public_doc.service_id')
            ->getwhere(['transaction.id' => $id])
            ->getRow();
---
SELECT `transaction`.`id` as `tid`, `medical_records`.`rm_id` as `id_rekam_medik`, `medical_records`.`fullname`, `transaction`.`loan_date`, `transaction`.`loan_desc`, `service_unit`.`service_name`
FROM `medical_records`
JOIN `transaction` ON `medical_records`.`rm_id` = `transaction`.`rm_id`
JOIN `transaction_public` ON `transaction`.`id` = `transaction_public`.`transaction_id`
JOIN `public_doc` ON `public_doc`.`id` = `transaction_public`.`public_id`
JOIN `service_unit` ON `service_unit`.`id` = `public_doc`.`service_id`
WHERE `transaction`.`id` = '3'